In [1]:
import pandas as pd

In [43]:
data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

In [44]:
courses

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [45]:
df = courses['class'].value_counts().reset_index()

In [46]:
df

      class  count
0      Math      6
1   English      1
2   Biology      1
3  Computer      1

In [47]:
 df = df[df['count'] >= 5][['class']]

In [55]:
df

  class
0  Math

In [ ]:
# we can also do with groupby function

In [56]:
df2 = courses.groupby('class').count().reset_index()

In [57]:
df2 = df2[df2['student'] > 4][['class']]

In [59]:
df2

  class
3  Math